cases/defect-correction/couetteFlow/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          0.5;

writeControl    timeStep;

writeInterval   50;

purgeWrite      3;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{

    sample1
    {
        type            sets;
        libs            (sampling);
        writeControl    writeTime;
        fields          (U p);
        interpolationScheme cellPoint;
        setFormat       raw;

        sets
        (
            centreLine
            {
                type        uniform;
                axis        y;
                start       (3.0 0 0.005);
                end         (3.0 1.0 0.005);
                nPoints     20;
            }
        );
    }
}



// ************************************************************************* //
